%%
clear
clc
disp('--------------------------------------------');
fprintf('Функция: f = -3*x^3+4*x+5\n');
%Локализация корня методом перебора
%Используя символьную математику
syms x;
f=-(3*x.^3)+(4*x)+5;
X=0;
h=0.1;
xh=X+h;
while subs(f, x, X)*subs(f, x, xh)>0
    X=xh;
    xh=X+h;
end
disp("Интервал локализации корня: "+X+" ; "+xh);
disp('--------------------------------------------');
%Расчет решения используя стандартные операторы MATLAB
f=inline('-(3*x^3)+(4*x)+5');
eps = 0.0001; disp("Решение fzero с точностью "+eps+":"); 
[x_fzero,fval,exitflag,output] = fzero(f, X, optimset('Display','off','TolX',eps));
disp("X="+x_fzero); disp("Вывод доп. информации: "); disp(output);
disp("Решение fsolve с точностью "+eps+":");
[xfsolve,fval,exitflag,output] = fsolve(f, X, optimset('Display','off','TolX',eps));
disp("X="+xfsolve); disp("Вывод доп. информации: "); disp(output);
disp('--------------------------------------------');
%Используя символьную математику
syms x;
f = -(3*x.^3)+(4*x)+5;
disp("Решение через символьную математику. X: "+double(solve(f,x,'Real',true)));
disp('--------------------------------------------');

%Метод простых итераций
disp("Метод простых итераций")
f=@(x) -3*x.^3+(4*x)+5;
fd=@(x) -9*x.^2+4;
%fy=(x0-f(x0)/fd(x0))'
fy = @(x0) -(18*x0*(- 3*x0^3 + 4*x0 + 5))/(9*x0^2 - 4)^2;
eps=0.0001;
disp("Заданная точность:" + eps);
x0=xh;
N=0;
%за x0 взята левая граница интервала
if abs(fy(x0))<1 %Проверка условия сходимости
        x=x0-f(x0)/fd(x0);
        while abs(x-x0)>eps
            x0=x;
            x=x0-f(x0)/fd(x0);
            N=N+1;
        end
        disp("Полученное X: " + x);
        disp("Количество итераций: " + N);
end
%Проверка решения
disp("Проверка решения уравнения: f(x)= " + f(x));
disp('--------------------------------------------');
%График
Xstep=X-h:0.0001:xh+h;
f = -(3*Xstep.^3)+(4*Xstep)+5;
%plot(Xstep, f);
%hold on
%plot(x,0,'*r');
%grid on
%hold off
disp('--------------------------------------------');

disp("Метод хорд")
f=inline('-(3*x.^3)+(4*x)+5');
f2=inline('-18*x');
disp("Заданная точность:" + eps);
x0=X;
x=0;
N=0;
a=xh;
b=X;
modab=abs(a-b);
%для выполнения условия поменяли местами границы a и b 
if f(a)*f2(a)>0 %Проверка условия сходимости
    while modab>eps
       x=a-(f(a)*(b-a))/(f(b)-f(a));
       if f(a)*f(x)<0
           b=x;
       end
       if f(b)*f(x)<0
           a=x;
       end
       modab=abs(x-x0);
       x0=x;
       N=N+1;
    end    
end  
disp("Полученное X: " + x);
disp("Количество итераций: " + N);
%Проверка решения
disp("Проверка решения уравнения: f(x)= " + f(x));
disp('--------------------------------------------');
%График
Xstep=X-h:0.0001:xh+h;
f = -(3*Xstep.^3)+(4*Xstep)+5;
plot(Xstep, f);
hold on
plot(x,0,'*r');
grid on
hold off
disp('--------------------------------------------');

disp("Метод касательных (Ньютона)")
f=inline('-(3*x.^3)+(4*x)+5');
fd=inline('-(9*x^2)+4');
temp=1;
x0=xh;
x=0;
N=0;
disp("Заданная точность:" + eps);
%для выполнения условия взяли за x0 правую границу интервала
if f(x0)*f2(x0)>0 %Проверка условия сходимости
    while temp>eps 
        x=x0-f(x0)/fd(x0);
        temp=abs(x0-x);
        x0=x;
        N=N+1;
        if(N > 1000) 
            break;
        end
    end
end
disp("Полученное X: " + x);
disp("Количество итераций: " + N);
%Проверка решения
disp("Проверка решения уравнения: f(x)= " + f(x));
disp('--------------------------------------------');
%График
Xstep=X-h:0.0001:xh+h;
f = -(3*Xstep.^3)+(4*Xstep)+5;
plot(Xstep, f);
hold on
plot(x,0,'*r');
grid on
hold off
disp('--------------------------------------------');
disp("Метод секущих")
f=inline('-(3*x.^3)+(4*x)+5');
temp=1;
x0=xh;
x=0;
N=0;
x01=0;
eps=0.0001;
disp("Заданная точность:" + eps);
%для выполнения условия взяли за x0 правую границу интервала
if f(x0)*f2(x0)>0 %Проверка условия сходимости
    while temp>eps 
            x=x0-(f(x0)*(x0-x01))/(f(x0)-f(x01));
            x01=x0;
            temp=abs(x0-x);
            x0=x;
            N=N+1;
    end
end
disp("Полученное X: " + x);
disp("Количество итераций: " + N);
%Проверка решения
disp("Проверка решения уравнения: f(x)= " + f(x));
disp('--------------------------------------------');
%График
Xstep=X-h:0.0001:xh+h;
f = -(3*Xstep.^3)+(4*Xstep)+5;
plot(Xstep, f);
hold on
plot(x,0,'*r');
grid on
hold off
disp('--------------------------------------------');
