clear
clc
%Данные
x = [0.0;        0.10;        0.20;      0.30;     0.5;       0.60];
y = [3.0;        4.5;         1.7;       0.7;      -1.0;      -1.4];
p = [0.5;        0.8;         0.8;       0.8;      0.1;       0.2];
x1_data=0.22;
x2_data=0.39;
%Определить степень полинома, наиболее точно аппроксимирующего экспериментальные данные
p0 = polyfit(x, y, 0);
p1 = polyfit(x, y, 1);
p2 = polyfit(x, y, 2);
p3 = polyfit(x, y, 3);
p4 = polyfit(x, y, 4);
% Вычислим ошибки (СКО) в квадрате:
y0 = polyval(p0, x);
y1 = polyval(p1, x);
y2 = polyval(p2, x);
y3 = polyval(p3, x);
y4 = polyval(p4, x);
err0=(1/6*sum((y-y0).^2))^0.5;
err1=(1/6*sum((y-y1).^2))^0.5;
err2=(1/6*sum((y-y2).^2))^0.5;
err3=(1/6*sum((y-y3).^2))^0.5;
err4=(1/6*sum((y-y4).^2))^0.5;
disp("Значения ошибок при разных степенях полинома");
disp("n = 0: " + err0);
disp("n = 1: " + err1);
disp("n = 2: " + err2);
disp("n = 3: " + err3);
disp("n = 4: " + err4);
disp("Самая точная степень полинома = 4");
disp("----------------------------------------------------------------------------------");
%Построить аппроксимационный полином без учёта весовых коэффициентов 
%с использованием определителя Вандермонда
disp("--------------------------Без учета весовых коэффициентов-------------------------");
% вычисляем коэффициенты полинома с использованием определителя Вандермонда
W = vander(x);
cond(W);
det(W);
A = W.'*W;
b = W.'*y;
a = inv(A)*b;
% вычисляем значения полинома в точках x1 и x2
y1_data = polyval(a,x1_data);
y2_data = polyval(a,x2_data);
disp("Значения в заданных точках x1=0.22 x2=0.39:");
disp("y1="+y1_data + " y2="+y2_data);
% выводим коэффициенты аппроксимирующего полинома и график
disp("Коэффициенты аппроксимирующего полиного полинома (с использованием определителя Вандермонда):");
disp(a);
% вычисляем значения полинома на заданном диапазоне x1
x1=-0.1:0.001:0.7;
y1=a(1)*x1.^4+a(2)*x1.^3+a(3)*x1.^2+a(4)*x1.^1+a(5)*x1.^0;
% вычисляем среднеквадратичную ошибку для оценки точности аппроксимации
mse = sum((polyval(a, x)- y).^2) / length(y);
% выводим результаты на экран
disp(['Среднеквадратичная ошибка (MSE) = ', num2str(mse)]);
% выводим график
figure();
%plot(x1,y1);
hold on;
%plot(x,y,'r*');
ylim([-15, 15]); 
%plot(x1_data,y1_data,'*black', x2_data,y2_data,'*black');
disp("----------------------------------------------------------------------------------");
disp("Коэффициенты аппроксимирующего полинома (с использованием стандартных операторов - polyfit):");
kfpoly = polyfit(x, y, 4);
disp(kfpoly');
x1=-0.1:0.001:0.7;
y1=kfpoly(1)*x1.^4+kfpoly(2)*x1.^3+kfpoly(3)*x1.^2+kfpoly(4)*x1.^1+kfpoly(5)*x1.^0;
y1_data=polyval(kfpoly,x1_data);
y2_data=polyval(kfpoly,x2_data);
disp("Значения в заданных точках x1=0.22 x2=0.39:");
disp("y1="+y1_data + " y2="+y2_data);
%График функции
%figure();
%plot(x1,y1);
hold on;
%plot(x,y,'g*');
plot(x1_data,y1_data,'*black', x2_data,y2_data,'*black');
%ylim([-25, 25]); 
%среднеквадратичная ошибка для оценки точности аппроксимирующего полинома
mse = sum((polyval(kfpoly, x)- y).^2) / length(y);
% Выводим результат на экран
disp(['Среднеквадратичная ошибка (MSE) = ', num2str(mse)]);
disp("----------------------------------------------------------------------------------");
%Построить аппроксимационный полином с учётом весовых коэффициентов с использованием функции spap2
disp("--------------------------С учетом весовых коэффициентов:-------------------------");
disp(p');
disp("----------------------------------------------------------------------------------");
disp("Коэффициенты аппроксимирующего полинома (с использованием spap2):");
sp = spap2(2,4,x,y,p);
disp(sp.coefs');
y1_data=fnval(sp, x1_data);
y2_data=fnval(sp, x2_data);
disp("Значения в заданных точках x1=0.22 x2=0.39:");
disp("y1="+y1_data + " y2="+y2_data);
%figure();
fnplt(sp);
hold on;
%plot(x,y,'r*');
%plot(x1_data,y1_data,'*g', x2_data,y2_data,'*g');
%ylim([-25, 25]); 
%среднеквадратичная ошибка для оценки точности аппроксимирующего полинома
polyval(sp.coefs', x);
mse = sum((fnval(sp, x)- y).^2) / length(y);
% Выводим результат на экран
disp(['Среднеквадратичная ошибка (MSE) = ', num2str(mse)]);
disp("----------------------------------------------------------------------------------");
%Построить аппроксимационный полином с учётом весовых коэффициентов с использованием функции fminsearch
a_n = a;
mins = @(a_n)(MinFun(a_n,x,y,p));
new_a = fminsearch(mins,a_n);
disp("Коэффициенты аппроксимирующего полинома (с использованием fminsearch):");
disp(new_a);
x1=-0.1:0.001:0.7;
y1 = new_a(1)*x1.^4 +new_a(2)*x1.^3 + new_a(3)*x1.^2 + new_a(4)*x1 + new_a(5);
y1_data=polyval(new_a,x1_data);
y2_data=polyval(new_a,x2_data);
disp("Значения в заданных точках x1=0.22 x2=0.39:");
disp("y1="+y1_data + " y2="+y2_data);
figure();
plot(x1,y1);
hold on;
plot(x,y,'*black');
plot(x1_data,y1_data,'*r', x2_data,y2_data,'*r');
ylim([-25, 25]); 
%среднеквадратичная ошибка для оценки точности аппроксимирующего полинома
mse = sum((polyval(new_a, x)- y).^2) / length(y);
% Выводим результат на экран
disp(['Среднеквадратичная ошибка (MSE) = ', num2str(mse)]);
disp("----------------------------------------------------------------------------------");
% вычисляем коэффициенты полинома Чебышева с учетом весовых коэффициентов
n = 4;
for k = 0:n
    for j = 0:n
        S(k+1,j+1) = sum(p.*(chebyshevT(k,x).*chebyshevT(j,x)));
    end
    b(k+1,1) = sum(p.*(y.*chebyshevT(k,x)));
end
aa = S\b;
disp("Коэффициенты аппроксимирующего полинома (с использованием полинома Чебышева):");
disp(aa);
% вычисляем значения полинома Чебышева в точках x
y_fit = zeros(size(x)-1);
for k = 0:n
    y_fit = y_fit + aa(k+1)*chebyshevT(k,x);
end
x1=-0.1:0.001:0.7;
y1=0;
for k = 0:n
    y1 = y1 + aa(k+1)*chebyshevT(k,x1);
end
y1_data=0;
for k = 0:n
    y1_data = y1_data + aa(k+1)*chebyshevT(k,x1_data);
end
y2_data=0;
for k = 0:n
    y2_data = y2_data + aa(k+1)*chebyshevT(k,x2_data);
end
disp("Значения в заданных точках x1=0.22 x2=0.39:");
disp("y1="+y1_data + " y2="+y2_data);
% выводим график с результатами аппроксимации
figure();
plot(x1,y1);
hold on;
plot(x,y,'*black');

plot(x1_data,y1_data,'*g', x2_data,y2_data,'*g');
ylim([-15, 15]); 
%среднеквадратичная ошибка для оценки точности аппроксимирующего полинома
mse = sum((y_fit - y).^2) / length(y);
% Выводим результат на экран
disp(['Среднеквадратичная ошибка (MSE) = ', num2str(mse)]);


function m = MinFun(a,x,y,p)
    m=0;
    for i=1:length(x)-1
        f=p(i)*(y(i)-a(5)-a(4)*x(i)-a(3)*x(i).^2-a(2)*x(i).^3-a(1)*x(i).^4);
    end
end


