clear
clc
x = [10 10.01 10.02 10.03 10.04 10.05];
y = [1 13.300787 25.71176 38.21209 50.809229 63.50377];

%заданная точка
x1_data = 10.036;
%таблица конечных разностей
d1y = diff(y, 1)';
d2y = diff(y, 2)';
d3y = diff(y, 3)';
d4y = diff(y, 4)';
d5y = diff(y, 5)';
disp("Таблица конечных разностей");
D = [d1y [d2y;0] [d3y;0;0] [d4y;0;0;0] [d5y;0;0;0;0]]
%оптим. степень
min_value = max(diff(y, 1)) - min(diff(y, 1));
for i = 1:length(x)-2
    if ((max(diff(y, i))-min(diff(y, i))) < min_value)
        index_min = i;
        min_value = max(diff(y, i)) - min(diff(y, i));
    end
end
disp("Оптимальная степень интерполяционного полинома: " + index_min);
%disp("-------------------------------------------------------------------------");
%определитель вандермонда
x = [10; 10.01; 10.02; 10.03; 10.04; 10.05];
y = [1; 13.300787; 25.71176; 38.21209; 50.809229 ;63.50377];

W = vander(x);
disp("Определитель Вандермонда: " + det(W));

%коэффициенты полинома
a = inv(W)*y;
disp("Коэффициенты полинома: ");
disp(a);
%канонический полином
figure();
xx = 9.8:0.01:10.20;
yk = a(1)*xx.^5 + a(2)*xx.^4 + a(3)*xx.^3 + a(4)*xx.^2 + a(5)*xx + a(6);
x1_data = 10.036;
plot(xx,yk,x,y,"*")
hold on
plot(x1_data,polyval(a, x1_data),"*g")

%интерполяция сплайнами
figure();
x = [10; 10.01; 10.02; 10.03; 10.04; 10.05];
y = [1; 13.300787; 25.71176; 38.21209; 50.809229 ;63.50377];
xx1 = 9.8:0.01:10.20;
yy1 = spline(x,y,xx1);
plot(x,y,'*',xx1,yy1)
hold on
plot(x1_data,spline(x,y,x1_data),"*g")
disp("-------------------------------------------------------------------------");
%стандартные операторы матлаб
x = [10; 10.01; 10.02; 10.03; 10.04; 10.05];
y = [1; 13.300787; 25.71176; 38.21209; 50.809229 ;63.50377];
kopo = polyfit(x,y,5);
disp("Коэффициенты полинома найденные через стандартные операторы: ");
disp(kopo);
x1 = 9.8:0.01:10.20;
y1 = kopo(1)*x1.^5 + kopo(2)*x1.^4 + kopo(3)*x1.^3 + kopo(4)*x1.^2 + kopo(5)*x1 + kopo(6);
yf = polyval(kopo, x1);
figure();
plot(x1,yf,'Color','r');
plot(x1,yf,x,y,'*')
hold on
plot(x1_data,polyval(kopo,x1_data),"*g")
disp("-------------------------------------------------------------------------");

%оценка погрешностей
disp("Оценка погрешности")
x = [10 10.01 10.02 10.03 10.04 10.05];
y = [1 13.300787 25.71176 38.21209 50.809229 63.50377];
disp("Погрешность polyfit: " +(norm(polyval(kopo, x)-y)/norm(y))*100+"%");
disp("Погрешность Вандермонд: " +(norm(polyval(a, x)-y)/norm(y))*100+"%");
disp("-------------------------------------------------------------------------");
disp("Значения в заданной точке x = 10.036: ")
disp("Polyfit: " + polyval(kopo, x1_data))
disp("Вандермонд: " + polyval(a, x1_data))



