clear
clc
%Данные
x = [0.298; 0.303; 0.310; 0.317; 0.323; 0.330];
y = [3.25578; 3.17639; 3.12180; 3.04819; 2.98755; 2.91950];
plot(x,y,'*');
hold on;
grid on;
%полином 5 степени

%конечные разности
d1 = diff(y,1)
d2 = diff(y,2)
d3 = diff(y,3)
d4 = diff(y,4)

%определитель вандермонда
W = vander(x);
disp("определитель вандермонда");
det(W)

%коэффициенты полинома
a = inv(W)*y
xi = 0.28:0.25:0.35;
yk = a(1)*xi.^5 + a(2)*xi.^4 + a(3)*xi.^3 + a(4)*xi.^2 + a(5)*xi + a(6);

%интерполяция сплайнами
x = [0.298 0.303 0.310 0.317 0.323 0.330];
y = [3.25578 3.17639 3.12180 3.04819 2.98755 2.91950];
xx1 = 0.28:0.25:0.35;
yy1 = spline(x,y,xx1);

%значение функции в точках, данных в задании
x2 = 0.308
y2 = a(1)*x2.^5 + a(2)*x2.^4 + a(3)*x2.^3 + a(4)*x2.^2 + a(5)*x2 + a(6)
x3 = 0.325
y3 = a(1)*x3.^5 + a(2)*x3.^4 + a(3)*x3.^3 + a(4)*x3.^2 + a(5)*x3 + a(6)
x4 = 0.312
y4 = a(1)*x4.^5 + a(2)*x4.^4 + a(3)*x4.^3 + a(4)*x4.^2 + a(5)*x4 + a(6)

%стандартные операторы матлаб
disp("коэффициенты полинома:");
kopo = polyfit(x,y,5)
x1 = 0.28:0.001:0.35;
y1 = kopo(1)*x1.^4 + kopo(2)*x1.^3 + kopo(3)*x1.^2 + kopo(4)*x1 + kopo(5);
yf = polyval(kopo, x1);
plot(x1,yf,'Color','r');

%pogreshn=(y(1)-(a(1)*x10.^5 + a(2)*x10.^4 + a(3)*x10.^3 + a(4)*x10.^2 + a(5)*x10 + a(6)).^2).^(1/2)