clc
%Данные
x = [4.9; 5.86; 9.6; 12.03; 14.52; 15.3]
y = [7.2879; 7.7919; 23.105; 59.2413; 139.5528; 177.8076]
plot(x,y,'*');
hold on;
grid on;
%полином 5 степени

%конечные разности
d1 = diff(y,1)
d2 = diff(y,2)
d3 = diff(y,3)
d4 = diff(y,4)

%определитель вандермонда
W = vander(x);
disp("определитель вандермонда");
det(W)

%коэффициенты полинома
a = inv(W)*y
xi = 3:0.001:16;
yk = a(1)*xi.^5 + a(2)*xi.^4 + a(3)*xi.^3 + a(4)*xi.^2 + a(5)*xi + a(6);

%интерполяция сплайнами
x = [4.9 5.86 9.6 12.03 14.52 15.3];
y = [7.2879 7.7919 23.105 59.2413 139.5528 177.8076];
xx1 = 3:.25:16;
yy1 = spline(x,y,xx1);

%значение функции в точках, данных в задании
x2 = 9.72
x3 = 13.94
y3 = a(1)*x3.^5 + a(2)*x3.^4 + a(3)*x3.^3 + a(4)*x3.^2 + a(5)*x3 + a(6)
x4 = 7.49
y4 = a(1)*x4.^5 + a(2)*x4.^4 + a(3)*x4.^3 + a(4)*x4.^2 + a(5)*x4 + a(6)

%стандартные операторы матлаб
disp("коэффициенты полинома:");
kopo = polyfit(x,y,5)
x1 = 3:0.001:16;
y1 = kopo(1)*x1.^4 + kopo(2)*x1.^3 + kopo(3)*x1.^2 + kopo(4)*x1 + kopo(5);
yf = polyval(kopo, x1);
plot(x1,yf,'Color','r');

pogreshn=(y(1)-(a(1)*x(1).^5 + a(2)*x(1).^4 + a(3)*x(1).^3 + a(4)*x(1).^2 + a(5)*x(1) + a(6)).^2).^(1/2)