/* TODO:
    Сделать "записную книжку".
    Взять форму в которой есть несколько полей (ФИО, возраст и телефон) и кнопка "Отправить"
    При "отправке формы" должно срабатывать событие, в котором:
        1) Будут получены все данные с формы
        2) Они должны быть проверены (в фио нет цифр,возраст не "Абфцуксм" и так далее...)
        3) После проверки нужно вывести все полученные данные под формой, а также показать их в консоли (в виде объекта).
        4) Должна быть кнопка, при клике по которой в консоли должна появится вся "записная книжка".


    // При идеальном выполнении 1.5 доп балла. Срок до 23:00. Задание заливать на codepen
*/