%%
clc
%График
y1 = ezplot('(2*x.^2 + 2*y.^2 - 1)^5 - 22*x.^2 * y.^3');
set(y1,'Color','b','LineWidth',2);
hold on;
y2 = ezplot('-0.05*x.^2 - 2.5*x + 0.25 - y');
set(y2,'Color','b','LineWidth',2);
grid on;

%Решение с помощью встроенных функций

[xr, fr, ex] = fsolve(@func,[1.0, 1.0],optimset('TolX',1.0e-4));
disp("Решение fsolve");
xr
hold on;
plot(xr(1), xr(2), '*r');

syms x y;
jackob=jacobian([(2*x.^2 + 2*y.^2 - 1)^5 - 22*x.^2 * y.^3,-0.05*x.^2 - 2.5*x + 0.25 - y],[x, y]);
disp("Якобиан");
disp(jackob);
disp("Определитель Якобиана");
disp(det(jackob));

disp("-----------------------------------------------------");
% Метод простых итераций
disp('Метод простых итераций');
x0 = 0 ; %точки полученные графически
y0 = 1; %возьмем их за начальное приближение

normarr = norm(subs(subs(jackob,x,x0),y,y0));

y = -0.05*x0.^2 - 2.5*x0 + 0.25;
x = ((2*x0.^2 + 2*y.^2 - 1)^5 / (22 * y.^3)).^0.5;

e = 0.0001; %точность
k = 0; %счетчик итераций
if normarr < 1 %условие сходимости
    while or((abs(x - x0 ) > e), (abs(y - y0) > e)) %пока точность не будет достигнута
        x0 = x;
        y0 = y;
        y = -0.05*x0.^2 - 2.5*x0 + 0.25;
        x = ((2*x0.^2 + 2*y.^2 - 1)^5 / (22 * y.^3)).^0.5;
        k = k + 1;
    end
    k
    x
    y
    else 
        disp('Не выполняется условие сходимости');
        disp(double(normarr)+">1");
end

disp("-----------------------------------------------------");
disp("Метод Ньютона");
iterations = 0 ;
X=[-2 -2];
X1=[1 1];

while and((abs(X1(1)-X(1))>e),(abs(X1(2)-X(2))>e))
        X(1) = X1(1);
        X(2) = X1(2);

        f0=[-(2*X(1).^2 + 2*X(2).^2 - 1).^5 + 22*X(1).^2 * X(2).^3;
            0.05*X(1).^2 + 2.5*X(1) - 0.25 + X(2)];
        w= [20*X(1)*(2*X(1).^2 + 2*X(2).^2 - 1).^4 - 44*X(1)*X(2).^3, 20*X(2)*(2*X(1).^2 + 2*X(2).^2 - 1).^4 - 66*X(1).^2*X(2).^2;
            - X(1)/10 - 5/2,                                      -1];
        if abs(det(w)) <= 0.0001 %проверка якобиана
            break;
        end
        X1 = X + inv(w)*f0;
        iterations = iterations +1;
        if (iterations > 100)
           break;
        end
end
disp("Корни Х = "+X1(1)+" Y = "+X1(2));
disp("Количество итераций "+iterations);

function f = func(x)
    f(1) = (2*x(1).^2 + 2*x(2).^2 - 1)^5 - 22*x(1).^2 * x(2).^3;
    f(2) = -0.05*x(1).^2 - 2.5*x(1) + 0.25 - x(2);
end



